{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Alexander Yakovlev",
	"language": "en",
	"home_page_url": "https://alexjameson.github.io/",
	"feed_url": "https://alexjameson.github.io/feed/feed.json",
	"description": "Docs as magic",
	"author": {
		"name": "Alexander Yakovlev",
		"url": "https://alexjameson.github.io/about-me/"
	},
	"items": [
		{
			"id": "https://alexjameson.github.io/blog/1-technical-writer-skills/technical-writer-skills/",
			"url": "https://alexjameson.github.io/blog/1-technical-writer-skills/technical-writer-skills/",
			"title": "Technical writer skills",
			"content_html": "<p>Here’s my personal list of  competencies that tech writers must master to thrive in their field.</p>\n<h2 id=\"essential-skills\" tabindex=\"-1\">Essential Skills <a class=\"header-anchor\" href=\"https://alexjameson.github.io/blog/1-technical-writer-skills/technical-writer-skills/\">#</a></h2>\n<h3 id=\"technical-skills\" tabindex=\"-1\">Technical Skills <a class=\"header-anchor\" href=\"https://alexjameson.github.io/blog/1-technical-writer-skills/technical-writer-skills/\">#</a></h3>\n<p>First and foremost, technical writers need to have a solid understanding of technology. This doesn’t mean they need to code like a software engineer, but they should be comfortable with various technologies and be able to understand and explain technical products.</p>\n<p>Technical competency goes beyond general tech know-how. It encompasses a robust understanding of operating systems, basic coding skills (preferably in an accessible, widely-used language like Python), and familiarity with command-line interfaces.</p>\n<p>It's also useful to be familiar with software tools that aid in writing and publishing documentation.</p>\n<h3 id=\"linguistic-and-stylistic-skills\" tabindex=\"-1\">Linguistic and Stylistic Skills <a class=\"header-anchor\" href=\"https://alexjameson.github.io/blog/1-technical-writer-skills/technical-writer-skills/\">#</a></h3>\n<p>Linguistic skills  mean being able to write clearly and succinctly while turning complex information into easy-to-understand text. This ability is fundamental because these writers often need to communicate complex details in a way that someone without technical expertise can understand.</p>\n<p>Technical writers should be well-versed in technical writing guidelines provided by leaders in the industry such as Microsoft or Google, as well as international standards like those from ISO. These guidelines help ensure consistency, clarity, and compliance in technical documentation.</p>\n<h3 id=\"knowledge-management-and-analytical-skills\" tabindex=\"-1\">Knowledge Management and Analytical Skills <a class=\"header-anchor\" href=\"https://alexjameson.github.io/blog/1-technical-writer-skills/technical-writer-skills/\">#</a></h3>\n<p>Technical writers often work with large volumes of information and data. Being able to organize, manage, and retrieve this knowledge efficiently is a must. Skills in knowledge management help the writer maintain consistency throughout documents and projects, manage revisions, and ensure all documentation is up-to-date and accurate.</p>\n<p>Technical writers must possess strong analytical skills to determine what information is crucial and how to structure that information in a logical, accessible manner. Understanding the needs of the audience, the goals of the documentation, and the most impactful data presentations are all part of this competency. Strong analytical skills help writers prioritize content, foresee user questions or challenges, and cater documentation to meet user needs effectively.</p>\n<h3 id=\"domain-competency\" tabindex=\"-1\">Domain Competency <a class=\"header-anchor\" href=\"https://alexjameson.github.io/blog/1-technical-writer-skills/technical-writer-skills/\">#</a></h3>\n<p>It helps when technical writers have specialized knowledge in a specific field, like IT, engineering, or medicine. This domain competency allows them to understand the context deeply and provide accurate, reliable information. It also reduces their reliance on subject matter experts and speeds up their work.</p>\n<p>Every industry has its jargon and style. Technical writers need to be adept in the specific stylistic and terminology preferences of the field they are writing for. Whether it’s using the correct medical terms or the informal tone often found in software development, understanding and applying these nuances in their writing helps ensure clarity and user-friendliness.</p>\n<h3 id=\"proficiency-in-content-creation-tools\" tabindex=\"-1\">Proficiency in Content Creation Tools <a class=\"header-anchor\" href=\"https://alexjameson.github.io/blog/1-technical-writer-skills/technical-writer-skills/\">#</a></h3>\n<p>Technical writers should be proficient with various document creation tools such as Microsoft Word, and also with content management and documentation platforms like Confluence.</p>\n<p>It is also good to understand the 'docs as code' approach, which supposes using the same tools to create and maintain tools as code. This includes being familiar with languages like Markdown to write docs in editors like VS Code, and working with such version control systems like Git.</p>\n<p>A technical writer should be proficient with graphical editors. This skill involves using tools like Adobe Photoshop, Adobe Illustrator, or simpler tools such as Snagit for creating clear and instructive images and diagrams. The ability to generate and manipulate visual content allows the writer to convey complex information in a more digestible and engaging manner.</p>\n<h2 id=\"skills-that-will-make-you-shine\" tabindex=\"-1\">Skills That Will Make You Shine <a class=\"header-anchor\" href=\"https://alexjameson.github.io/blog/1-technical-writer-skills/technical-writer-skills/\">#</a></h2>\n<p>These expanded and enhanced skills form the backbone of a competent technical writer, ensuring not only the creation of accurate, clear, and helpful technical documentation but also guaranteeing that the content is accessible, engaging and discoverable by the target audience.</p>\n<p>By integrating these additional skills—graphic editing and AI knowledge—into their repertoire, technical writers not only increase the value of their output but also align their capabilities with cutting-edge technological trends. This not only enhances the quality and effectiveness of their work but also positions them as integral contributors in the increasingly digital and visually-oriented technical landscape.</p>\n<h3 id=\"leveraging-artificial-intelligence\" tabindex=\"-1\">Leveraging Artificial Intelligence <a class=\"header-anchor\" href=\"https://alexjameson.github.io/blog/1-technical-writer-skills/technical-writer-skills/\">#</a></h3>\n<p>As artificial intelligence (AI) continues to evolve, technical writers can harness the power of AI to boost productivity. Specifically, understanding and leveraging neural networks can be a game-changer. Neural networks are a type of AI modeled after the human brain, and they can assist in several aspects of technical writing. For instance, AI-driven tools can help with language translation, content suggestion, and even grammar and style checks. More sophisticated uses include summarizing extensive documentation and generating first drafts based on bulleted outlines. By understanding how neural networks operate and can be applied, technical writers can vastly speed up their writing process, enhance the accuracy of content, and free up time to focus on more complex, creative tasks. Furthermore, embracing AI tools can keep technical writers at the forefront of technological advancements, making their work more efficient and future-proof.</p>\n<h3 id=\"marketing-and-seo-skills\" tabindex=\"-1\">Marketing and SEO Skills <a class=\"header-anchor\" href=\"https://alexjameson.github.io/blog/1-technical-writer-skills/technical-writer-skills/\">#</a></h3>\n<p>In today’s digital world, it’s useful for technical writers to have a grasp of marketing basics, including SEO (Search Engine Optimization). Documents are not only printed but also published on various platforms online. Knowing how to make a document not only informative and engaging but also easy to find through search engines, can significantly increase its reach and readability.</p>\n<p>An expanded skill in today’s digital realm is SEO knowledge. Technical writers should understand the basics of SEO to enhance the online visibility of their documents. This skill is crucial when the documentation is available on the internet where it should be findable via search engines. Incorporating keywords, understanding search engine algorithms, and formatting documents for the web can dramatically increase the reach and usability of technical content.</p>\n<h3 id=\"design-skills\" tabindex=\"-1\">Design Skills <a class=\"header-anchor\" href=\"https://alexjameson.github.io/blog/1-technical-writer-skills/technical-writer-skills/\">#</a></h3>\n<p>Understanding basic design principles can significantly enhance a technical writer's work. For example, knowing how readers typically scan a page (like the F-pattern in reading web content) can help in structuring information in a more reader-friendly manner. Good design helps in guiding the reader's behavior, making it easier for them to find the information they need quickly and efficiently.</p>\n<h3 id=\"enhanced-knowledge-gathering-skills\" tabindex=\"-1\">Enhanced Knowledge Gathering Skills <a class=\"header-anchor\" href=\"https://alexjameson.github.io/blog/1-technical-writer-skills/technical-writer-skills/\">#</a></h3>\n<p>Good technical writers excel in gathering information from subject matter experts (SMEs) efficiently. This involves having excellent interpersonal and communication skills to build trust and rapport with SMEs. By asking the right questions and being able to understand complex responses, writers can extract and distilled the necessary information accurately. Being able to interpret and verify the information quickly also helps in creating precise and clear documentation.</p>\n<p>In essence, being a successful technical writer isn’t just about being good with words or tech-savvy; it’s about a blend of multiple competencies. Whether it’s understanding the complex domain-specific details, managing the knowledge efficiently, or ensuring the content is easily accessible and understandable—these skills collectively empower technical writers to produce high-quality and effective documentation.</p>\n",
			"date_published": "2023-01-23T00:00:00Z"
		}
		
	]
}
